[
    {
        "id": 0,
        "name": "Peer-to-Peer Network",
        "definition": "Is a distributed application architecture that partitions tasks or workloads between peers. Peers are equally privileged, equipotent participants in the application. They are said to form a peer-to-peer network of nodes."
    },
    {
        "id": 1,
        "name": "Public Blockchain",
        "definition": `In a public blockchain anyone can participate, without permission. Public blockchains are based on open source Proof of Work consensus algorithms.
        Anyone can download the code and start running a public node on their local device, validating transactions in the network, thus participating in the consensus process. In such blockchains anyone can send transactions and see valid transactions. The transactions are transparent but pseudonymised.
        It is this type of blockchain the Bitcoin blockchain and the Ethereum platform is built upon and which is expected to disrupt the internet as we know it today.`
    },
    {
        "id": 2,
        "name": "Private Blockchain",
        "definition": `A private blockchain is permissioned. One cannon join unless invited by the network administrators. This type of blockchains can be considered a middle-ground for companies that are interested in the blockchain technology in general but are not comfortable with a level of control offered by public networks. Typically, they seek to incorporate blockchain into their accounting and record-keeping procedures without sacrificing autonomy and running the risk of exposing sensitive data to the public internet.`
    },
    {
        "id": 3,
        "name": "Block hash calculation",
        "definition": `The hashing function takes incoming data and returns a hash representing the entire block. This hash is a combination of index, timestamp, previous hash, block data, and nonce.`
    },
    {
        "id": 4,
        "name": "Block",
        "definition":`The blockchain consists of blocks that gets added on each other. Each block consists of an index, a timestamp, a hash, the previous hash, data, and a nonce. `
    },
    {
        "id": 5,
        "name": "Data",
        "definition": `Each block can contain a small amount of data. Usually this is data about transactions taking place, such as cryptocurrencies exchanging hands. `
    },
    {
        "id": 6,
        "name": "Genesis Block",
        "definition": `Every blockchain needs a starting block often referred to as the 'Genesis Block'. Since this block don't have a previous block the previous hash is '0'.`
    },
    {
        "id": 7,
        "name": "Hash",
        "definition": `A hash is an alphanumeric value that uniquely identifies data, or the 'digital fingerprint' of data.  
        `
    },
    {
        "id": 8,
        "name": "Nonce",
        "definition": `A nonce is a number added to a hashed block which when rehashed meets the difficulty level restrictions. The nonce is the number that blockchain miners are solving for.  
        `
    },
    {
        "id": 9,
        "name": "Valid hash",
        "definition": ` For a hash to be valid it needs to reach the difficulty requirement. The difficulty can change depending on how many zeroes is needed in front. In this blockchain three leading zeroes are needed to have a valid hash. `
    },
    {
        "id": 10,
        "name": "Federated or Consortium Blockchains",
        "definition": `Federated blockchains are operated under the leadership of a group. Unlike the completely decentralized open and public blockchains, the federated blockchains operate under the leadership of a group.
        This means only selected individuals can access the blockchain. The consensus process is controlled by a pre-selected set of nodes.
        Federated blockchains are faster and have higher scalability and provide more transaction privacy. Such blockchains are expected to be particularly popular in the banking sector.`
    },
    {
        "id": 11,
        "name": "Blockchain",
        "definition": `A blockchain is a growing list of records, called blocks, linked together with cryptography (hashing functions) distributed in a peer to peer sharing network. This chain is a decentralized ledger which is synchronized and stored on each node (computer in the network) in a way that makes it practically impossible to modify the transactional data stored on the block. `
    },
    {
        "id": 12,
        "name": "Distributed Ledger Technology",
        "definition": `A blockchain is a ledger distributed in a peer to peer network. Often the term Distributed Ledger Technology and Blockchain are used interchangeably. This can be somewhat misleading since although a blockchain is always a distributed ledger, a distributed ledger doesn't always have to be stored on a chain such a blockchain.
        The Distributed Ledger is a ledger (database) shared and synchronized by consensus on each node (computer ) in a peer to peer network. However, the ledger doesn't need to consist of blocks and is therefore not always considered a 'Blockchain'.  `
    },
    {
        "id": 13,
        "name": "Immutability",
        "definition": `Blockchains uses a combination of cryptographic signatures, merkle chains and a transparent distributed peer to peer consensus system to make the record of transactions practically immutable. This creates a tamper free environment where one does no longer need to trust the record keeper.`
    },
    {
        "id": 14,
        "name": "Decentralization",
        "definition": `The decentralized nature of blockchains enabled by practically unhackable automated transactions means that one doesn't need to rely on decentralized middlemen. By creating trustful automated transactions one can create decentralized systems where middlemen, such as institutions, are not needed.  `
    },
    {
        "id": 15,
        "name": "Node",
        "definition": `A node is a computer device on a blockchain network, it can be any active electronic device which is connected to the internet with an IP address.
        The owners of the nodes contribute computing resources to store and validate transactions on the blockchain.`
    },
    {
        "id": 16,
        "name": "Proof of Work",
        "definition":`The proof of work algorithm is used to confirm transactions and produce new blocks to the chain. With PoW, miners compete against each other to complete transactions on the network and get rewarded. 
        A hash below a target value can only be obtained, on average, by performing a certain amount of brute force work — therefore demonstrating proof of work.
        `
    }

]